bananu7/Arduino/bootstrap/boards.txt
bartek.name=Bartekino (8Mhz internal)

bartek.vid.0=0x2341
bartek.pid.0=0x0043
bartek.vid.1=0x2341
bartek.pid.1=0x0001
bartek.vid.2=0x2A03
bartek.pid.2=0x0043
bartek.vid.3=0x2341
bartek.pid.3=0x0243

bartek.upload.tool=avrdude
bartek.upload.protocol=arduino
bartek.upload.maximum_size=32256
bartek.upload.maximum_data_size=2048
bartek.upload.speed=57600

bartek.bootloader.tool=avrdude
bartek.bootloader.low_fuses=0x62
bartek.bootloader.high_fuses=0xDF
bartek.bootloader.extended_fuses=0xFF
bartek.bootloader.unlock_bits=0x3F
bartek.bootloader.lock_bits=0x0F
bartek.bootloader.file=optiboot/optiboot_atmega328.hex

bartek.build.mcu=atmega328p
bartek.build.f_cpu=8000000L
bartek.build.core=arduino
bartek.build.variant=standard

bartekboot.name=Bartekino (8Mhz Int + Bootloader)

bartekboot.vid.0=0x2341
bartekboot.pid.0=0x0043
bartekboot.vid.1=0x2341
bartekboot.pid.1=0x0001
bartekboot.vid.2=0x2A03
bartekboot.pid.2=0x0043
bartekboot.vid.3=0x2341
bartekboot.pid.3=0x0243

bartekboot.upload.tool=avrdude
bartekboot.upload.protocol=arduino
bartekboot.upload.maximum_size=32256
bartekboot.upload.maximum_data_size=2048
bartekboot.upload.speed=57600

bartekboot.bootloader.tool=avrdude
bartekboot.bootloader.low_fuses=0xE2
bartekboot.bootloader.high_fuses=0xDE
bartekboot.bootloader.extended_fuses=0xFF
bartekboot.bootloader.unlock_bits=0x3F
bartekboot.bootloader.lock_bits=0x0F
bartekboot.bootloader.file=optiboot/optiboot_atmega328_pro_8MHz.hex

bartekboot.build.mcu=atmega328p
bartekboot.build.f_cpu=8000000L
bartekboot.build.core=arduino
bartekboot.build.variant=standard